---
kind: other
id: Properties.T:Autodesk.Revit.DB.InternalDefinition
source: html/e08c6586-26b2-2c2b-a699-3d4186dc3393.htm
---
# InternalDefinition Properties

Tests whether this definition identifies a built-in parameter or not.